# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
# $PATH=$(brew --prefix coreutils)/libexec/gnubin:$PATH
brew 'coreutils'
# Install some other useful utilities like `sponge`
#brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`
#brew install gnu-sed --default-names
# Install Bash 4
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before running `chsh`.
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/dupes'
tap 'homebrew/versions'
brew 'homebrew/dupes/grep'
#brew 'homebrew/dupes/screen'
brew 'ack'
brew 'git'
brew 'openssl'
# TODO: may need to add /usr/local/share/npm/bin to PATH, check this
brew 'node@10'
brew 'yarn'
brew 'jq'
brew 'unrar'
brew 'wget'
brew 'watch'
brew 'homebrew/dupes/openssh'
brew 'nmap'
brew 'curl'
# brew 'heroku-toolbelt'
# TODO: need to run heroku update to ensure latest version
# tool to easily access gitignore boilerplates - https://github.com/simonwhitaker/gibo - https://github.com/github/gitignore
brew 'gibo'

brew 'ssh-copy-id'
# brew 'mongodb'
brew 'thefuck'
brew 'tree'

# http://caskroom.io/search
# https://caskroomstore.org/
tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'caskroom/cask/brew-cask'

# verify cask install
#brew cask doctor

cask 'alfred'
cask 'anvil'

# TODO: need to run the installer after this
# open /opt/homebrew-cask/Caskroom/backblaze/latest/Backblaze\ Installer.app
cask 'backblaze'

# GPG Suite
cask 'gpgtools'

cask 'caffeine'
cask 'cheatsheet'
cask 'cyberduck'
cask 'dash'
cask 'docker-toolbox'
cask 'dropbox'
# cask 'firefox'
# cask 'firefox-beta'
cask 'fluid'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-beta'
cask 'google-chrome-canary'
cask 'grandperspective'
cask 'growlnotify'
cask 'hazel'
cask 'iterm2'
#cask 'libreoffice'
cask 'multifirefox'
#cask 'omnigraffle'
cask 'skype'
cask 'spectacle'
# install Sublime Text 3 dev - automatically links subl
cask 'sublime-text-dev'
cask 'the-unarchiver'
cask 'transmit'
# cask 'virtualbox'
# cask 'vagrant'
# cask 'vagrant-manager'
cask 'vlc'
# keyboards shortcuts to resize / position windows - https://www.irradiatedsoftware.com/sizeup/
cask 'sizeup'
# Lua-based automation, including window resize / potisioning - http://www.hammerspoon.org/
# cask 'hammerspoon'

# ## PICK A MOCKUP APP
# cask 'balsamiq'
# cask 'pencil'

cask 'keepassx'

# sshfs
cask 'osxfuse'
cask 'macfusion'

cask 'tunnelblick'

# new versions only available from Mac AppStore
cask 'ccmenu'

# Install useful Quick Look plugins for developers
# See https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'webpquicklook'
cask 'suspicious-package'

# build tools
# cask 'java'
# brew 'maven'
# brew 'gradle'

# IDEs etc.
# cask 'eclipse-java'
# cask 'sqlitebrowser'
